InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/SYSCTL/Peripheral/Register/xHeader/SYSCTL_RegisterAddress.h
/**
 *
 * @file SYSCTL_RegisterAddress.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 23 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 23 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */

#ifndef XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERADDRESS_H_
#define XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERADDRESS_H_

#include <xDriver_MCU/Common/xHeader/MCU_Variables.h>

#define SYSCTL_BASE    ((uint32_t) 0x400FE000UL)
#define SYSCTL_BITBANDING_BASE ((uint32_t) 0x42000000UL)
#define SYSCTL_OFFSET    ((uint32_t) 0x000FE000UL)

#define SYSCTL_DID0_OFFSET    ((uint32_t) 0x0000UL)
#define SYSCTL_DID1_OFFSET    ((uint32_t) 0x0004UL)

#define SYSCTL_PTBOCTL_OFFSET    ((uint32_t) 0x0038UL)

#define SYSCTL_RIS_OFFSET    ((uint32_t) 0x0050UL)
#define SYSCTL_IMC_OFFSET    ((uint32_t) 0x0054UL)
#define SYSCTL_MISC_OFFSET    ((uint32_t) 0x0058UL)

#define SYSCTL_RESC_OFFSET    ((uint32_t) 0x005CUL)

#define SYSCTL_PWRTC_OFFSET    ((uint32_t) 0x0060UL)
#define SYSCTL_NMIC_OFFSET    ((uint32_t) 0x0064UL)

#define SYSCTL_MOSCCTL_OFFSET    ((uint32_t) 0x007CUL)

#define SYSCTL_RSCLKCFG_OFFSET    ((uint32_t) 0x00B0UL)
#define SYSCTL_MEMTIM0_OFFSET    ((uint32_t) 0x00C0UL)

#define SYSCTL_RVP_OFFSET    ((uint32_t) 0x00D4UL)

#define SYSCTL_ALTCLKCFG_OFFSET    ((uint32_t) 0x0138UL)

#define SYSCTL_DSCLKCFG_OFFSET    ((uint32_t) 0x0144UL)
#define SYSCTL_DIVSCLK_OFFSET    ((uint32_t) 0x0148UL)
#define SYSCTL_SYSPROP_OFFSET    ((uint32_t) 0x014CUL)
#define SYSCTL_PIOSCCAL_OFFSET    ((uint32_t) 0x0150UL)
#define SYSCTL_PIOSCSTAT_OFFSET    ((uint32_t) 0x0154UL)

#define SYSCTL_PLLFREQ0_OFFSET    ((uint32_t) 0x0160UL)
#define SYSCTL_PLLFREQ1_OFFSET    ((uint32_t) 0x0164UL)
#define SYSCTL_PLLSTAT_OFFSET    ((uint32_t) 0x0168UL)

#define SYSCTL_SLPPWRCFG_OFFSET    ((uint32_t) 0x0188UL)
#define SYSCTL_DSLPPWRCFG_OFFSET    ((uint32_t) 0x018CUL)

#define SYSCTL_NVMSTAT_OFFSET    ((uint32_t) 0x01A0UL)

#define SYSCTL_LDOSPCTL_OFFSET    ((uint32_t) 0x01B4UL)
#define SYSCTL_LDOSPCAL_OFFSET    ((uint32_t) 0x01B8UL)
#define SYSCTL_LDODPCTL_OFFSET    ((uint32_t) 0x01BCUL)
#define SYSCTL_LDODPCAL_OFFSET    ((uint32_t) 0x01C0UL)

#define SYSCTL_SDPMST_OFFSET    ((uint32_t) 0x01CCUL)

#define SYSCTL_BOOTCFG_OFFSET    ((uint32_t) 0x01D0UL)

#define SYSCTL_RESBEHAVCTL_OFFSET    ((uint32_t) 0x01D8UL)

#define SYSCTL_USER_REG_OFFSET    ((uint32_t) 0x01E0UL)
#define SYSCTL_USER_REG0_OFFSET    ((uint32_t) 0x01E0UL)
#define SYSCTL_USER_REG1_OFFSET    ((uint32_t) 0x01E4UL)
#define SYSCTL_USER_REG2_OFFSET    ((uint32_t) 0x01E8UL)
#define SYSCTL_USER_REG3_OFFSET    ((uint32_t) 0x01ECUL)

#define SYSCTL_HSSR_OFFSET    ((uint32_t) 0x01F4UL)

#define SYSCTL_CCMCGREQ_OFFSET    ((uint32_t) 0x0204UL)

#define SYSCTL_FMPRE_OFFSET    ((uint32_t) 0x0200UL)
#define SYSCTL_FMPRE0_OFFSET    ((uint32_t) 0x0200UL)
#define SYSCTL_FMPRE1_OFFSET    ((uint32_t) 0x0204UL)
#define SYSCTL_FMPRE2_OFFSET    ((uint32_t) 0x0208UL)
#define SYSCTL_FMPRE3_OFFSET    ((uint32_t) 0x020CUL)
#define SYSCTL_FMPRE4_OFFSET    ((uint32_t) 0x0210UL)
#define SYSCTL_FMPRE5_OFFSET    ((uint32_t) 0x0214UL)
#define SYSCTL_FMPRE6_OFFSET    ((uint32_t) 0x0218UL)
#define SYSCTL_FMPRE7_OFFSET    ((uint32_t) 0x021CUL)
#define SYSCTL_FMPRE8_OFFSET    ((uint32_t) 0x0220UL)
#define SYSCTL_FMPRE9_OFFSET    ((uint32_t) 0x0224UL)
#define SYSCTL_FMPRE10_OFFSET    ((uint32_t) 0x0228UL)
#define SYSCTL_FMPRE11_OFFSET    ((uint32_t) 0x022CUL)
#define SYSCTL_FMPRE12_OFFSET    ((uint32_t) 0x0230UL)
#define SYSCTL_FMPRE13_OFFSET    ((uint32_t) 0x0234UL)
#define SYSCTL_FMPRE14_OFFSET    ((uint32_t) 0x0238UL)
#define SYSCTL_FMPRE15_OFFSET    ((uint32_t) 0x023CUL)

#define SYSCTL_USBPDS_OFFSET    ((uint32_t) 0x0280UL)
#define SYSCTL_USBMPC_OFFSET    ((uint32_t) 0x0284UL)
#define SYSCTL_EMACPDS_OFFSET    ((uint32_t) 0x0288UL)
#define SYSCTL_EMACMPC_OFFSET    ((uint32_t) 0x028CUL)
#define SYSCTL_CAN0PDS_OFFSET    ((uint32_t) 0x0298UL)
#define SYSCTL_CAN0MPC_OFFSET    ((uint32_t) 0x029CUL)
#define SYSCTL_CAN1PDS_OFFSET    ((uint32_t) 0x02A0UL)
#define SYSCTL_CAN1MPC_OFFSET    ((uint32_t) 0x02A4UL)

#define SYSCTL_PP_OFFSET    ((uint32_t) 0x0300UL)
#define SYSCTL_PPWD_OFFSET    ((uint32_t) 0x0300UL)
#define SYSCTL_PPTIMER_OFFSET    ((uint32_t) 0x0304UL)
#define SYSCTL_PPGPIO_OFFSET    ((uint32_t) 0x0308UL)
#define SYSCTL_PPDMA_OFFSET    ((uint32_t) 0x030CUL)
#define SYSCTL_PPEPI_OFFSET    ((uint32_t) 0x0310UL)
#define SYSCTL_PPHIB_OFFSET    ((uint32_t) 0x0314UL)
#define SYSCTL_PPUART_OFFSET    ((uint32_t) 0x0318UL)
#define SYSCTL_PPSSI_OFFSET    ((uint32_t) 0x031CUL)
#define SYSCTL_PPI2C_OFFSET    ((uint32_t) 0x0320UL)
#define SYSCTL_PPUSB_OFFSET    ((uint32_t) 0x0328UL)
#define SYSCTL_PPEPHY_OFFSET    ((uint32_t) 0x0330UL)
#define SYSCTL_PPCAN_OFFSET    ((uint32_t) 0x0334UL)
#define SYSCTL_PPADC_OFFSET    ((uint32_t) 0x0338UL)
#define SYSCTL_PPACMP_OFFSET    ((uint32_t) 0x033CUL)
#define SYSCTL_PPPWM_OFFSET    ((uint32_t) 0x0340UL)
#define SYSCTL_PPQEI_OFFSET    ((uint32_t) 0x0344UL)
#define SYSCTL_PPLPC_OFFSET    ((uint32_t) 0x0348UL)
#define SYSCTL_PPPECI_OFFSET    ((uint32_t) 0x0350UL)
#define SYSCTL_PPFAN_OFFSET    ((uint32_t) 0x0354UL)
#define SYSCTL_PPEEPROM_OFFSET    ((uint32_t) 0x0358UL)
#define SYSCTL_PPWTIMER_OFFSET    ((uint32_t) 0x035CUL)
#define SYSCTL_PPRTS_OFFSET    ((uint32_t) 0x0370UL)
#define SYSCTL_PPCCM_OFFSET    ((uint32_t) 0x0374UL)
#define SYSCTL_PPLCD_OFFSET    ((uint32_t) 0x0390UL)
#define SYSCTL_PPOWIRE_OFFSET    ((uint32_t) 0x0398UL)
#define SYSCTL_PPEMAC_OFFSET    ((uint32_t) 0x039CUL)
#define SYSCTL_PPPRB_OFFSET    ((uint32_t) 0x03A0UL)
#define SYSCTL_PPHIM_OFFSET    ((uint32_t) 0x03A4UL)

#define SYSCTL_FMPPE_OFFSET    ((uint32_t) 0x0400UL)
#define SYSCTL_FMPPE0_OFFSET    ((uint32_t) 0x0400UL)
#define SYSCTL_FMPPE1_OFFSET    ((uint32_t) 0x0404UL)
#define SYSCTL_FMPPE2_OFFSET    ((uint32_t) 0x0408UL)
#define SYSCTL_FMPPE3_OFFSET    ((uint32_t) 0x040CUL)
#define SYSCTL_FMPPE4_OFFSET    ((uint32_t) 0x0410UL)
#define SYSCTL_FMPPE5_OFFSET    ((uint32_t) 0x0414UL)
#define SYSCTL_FMPPE6_OFFSET    ((uint32_t) 0x0418UL)
#define SYSCTL_FMPPE7_OFFSET    ((uint32_t) 0x041CUL)
#define SYSCTL_FMPPE8_OFFSET    ((uint32_t) 0x0420UL)
#define SYSCTL_FMPPE9_OFFSET    ((uint32_t) 0x0424UL)
#define SYSCTL_FMPPE10_OFFSET    ((uint32_t) 0x0428UL)
#define SYSCTL_FMPPE11_OFFSET    ((uint32_t) 0x042CUL)
#define SYSCTL_FMPPE12_OFFSET    ((uint32_t) 0x0430UL)
#define SYSCTL_FMPPE13_OFFSET    ((uint32_t) 0x0434UL)
#define SYSCTL_FMPPE14_OFFSET    ((uint32_t) 0x0438UL)
#define SYSCTL_FMPPE15_OFFSET    ((uint32_t) 0x043CUL)

#define SYSCTL_SR_OFFSET    ((uint32_t) 0x0500UL)
#define SYSCTL_SRWD_OFFSET    ((uint32_t) 0x0500UL)
#define SYSCTL_SRTIMER_OFFSET    ((uint32_t) 0x0504UL)
#define SYSCTL_SRGPIO_OFFSET    ((uint32_t) 0x0508UL)
#define SYSCTL_SRDMA_OFFSET    ((uint32_t) 0x050CUL)
#define SYSCTL_SREPI_OFFSET    ((uint32_t) 0x0510UL)
#define SYSCTL_SRHIB_OFFSET    ((uint32_t) 0x0514UL)
#define SYSCTL_SRUART_OFFSET    ((uint32_t) 0x0518UL)
#define SYSCTL_SRSSI_OFFSET    ((uint32_t) 0x051CUL)
#define SYSCTL_SRI2C_OFFSET    ((uint32_t) 0x0520UL)
#define SYSCTL_SRUSB_OFFSET    ((uint32_t) 0x0528UL)
#define SYSCTL_SREPHY_OFFSET    ((uint32_t) 0x0530UL)
#define SYSCTL_SRCAN_OFFSET    ((uint32_t) 0x0534UL)
#define SYSCTL_SRADC_OFFSET    ((uint32_t) 0x0538UL)
#define SYSCTL_SRACMP_OFFSET    ((uint32_t) 0x053CUL)
#define SYSCTL_SRPWM_OFFSET    ((uint32_t) 0x0540UL)
#define SYSCTL_SRQEI_OFFSET    ((uint32_t) 0x0544UL)
#define SYSCTL_SRLPC_OFFSET    ((uint32_t) 0x0548UL)
#define SYSCTL_SRPECI_OFFSET    ((uint32_t) 0x0550UL)
#define SYSCTL_SRFAN_OFFSET    ((uint32_t) 0x0554UL)
#define SYSCTL_SREEPROM_OFFSET    ((uint32_t) 0x0558UL)
#define SYSCTL_SRWTIMER_OFFSET    ((uint32_t) 0x055CUL)
#define SYSCTL_SRRTS_OFFSET    ((uint32_t) 0x0570UL)
#define SYSCTL_SRCCM_OFFSET    ((uint32_t) 0x0574UL)
#define SYSCTL_SRLCD_OFFSET    ((uint32_t) 0x0590UL)
#define SYSCTL_SROWIRE_OFFSET    ((uint32_t) 0x0598UL)
#define SYSCTL_SREMAC_OFFSET    ((uint32_t) 0x059CUL)
#define SYSCTL_SRPRB_OFFSET    ((uint32_t) 0x05A0UL)
#define SYSCTL_SRHIM_OFFSET    ((uint32_t) 0x05A4UL)

#define SYSCTL_RCGC_OFFSET    ((uint32_t) 0x0600UL)
#define SYSCTL_RCGCWD_OFFSET    ((uint32_t) 0x0600UL)
#define SYSCTL_RCGCTIMER_OFFSET    ((uint32_t) 0x0604UL)
#define SYSCTL_RCGCGPIO_OFFSET    ((uint32_t) 0x0608UL)
#define SYSCTL_RCGCDMA_OFFSET    ((uint32_t) 0x060CUL)
#define SYSCTL_RCGCEPI_OFFSET    ((uint32_t) 0x0610UL)
#define SYSCTL_RCGCHIB_OFFSET    ((uint32_t) 0x0614UL)
#define SYSCTL_RCGCUART_OFFSET    ((uint32_t) 0x0618UL)
#define SYSCTL_RCGCSSI_OFFSET    ((uint32_t) 0x061CUL)
#define SYSCTL_RCGCI2C_OFFSET    ((uint32_t) 0x0620UL)
#define SYSCTL_RCGCUSB_OFFSET    ((uint32_t) 0x0628UL)
#define SYSCTL_RCGCEPHY_OFFSET    ((uint32_t) 0x0630UL)
#define SYSCTL_RCGCCAN_OFFSET    ((uint32_t) 0x0634UL)
#define SYSCTL_RCGCADC_OFFSET    ((uint32_t) 0x0638UL)
#define SYSCTL_RCGCACMP_OFFSET    ((uint32_t) 0x063CUL)
#define SYSCTL_RCGCPWM_OFFSET    ((uint32_t) 0x0640UL)
#define SYSCTL_RCGCQEI_OFFSET    ((uint32_t) 0x0644UL)
#define SYSCTL_RCGCLPC_OFFSET    ((uint32_t) 0x0648UL)
#define SYSCTL_RCGCPECI_OFFSET    ((uint32_t) 0x0650UL)
#define SYSCTL_RCGCFAN_OFFSET    ((uint32_t) 0x0654UL)
#define SYSCTL_RCGCEEPROM_OFFSET    ((uint32_t) 0x0658UL)
#define SYSCTL_RCGCWTIMER_OFFSET    ((uint32_t) 0x065CUL)
#define SYSCTL_RCGCRTS_OFFSET    ((uint32_t) 0x0670UL)
#define SYSCTL_RCGCCCM_OFFSET    ((uint32_t) 0x0674UL)
#define SYSCTL_RCGCLCD_OFFSET    ((uint32_t) 0x0690UL)
#define SYSCTL_RCGCOWIRE_OFFSET    ((uint32_t) 0x0698UL)
#define SYSCTL_RCGCEMAC_OFFSET    ((uint32_t) 0x069CUL)
#define SYSCTL_RCGCPRB_OFFSET    ((uint32_t) 0x06A0UL)
#define SYSCTL_RCGCHIM_OFFSET    ((uint32_t) 0x06A4UL)

#define SYSCTL_SCGC_OFFSET    ((uint32_t) 0x0700UL)
#define SYSCTL_SCGCWD_OFFSET    ((uint32_t) 0x0700UL)
#define SYSCTL_SCGCTIMER_OFFSET    ((uint32_t) 0x0704UL)
#define SYSCTL_SCGCGPIO_OFFSET    ((uint32_t) 0x0708UL)
#define SYSCTL_SCGCDMA_OFFSET    ((uint32_t) 0x070CUL)
#define SYSCTL_SCGCEPI_OFFSET    ((uint32_t) 0x0710UL)
#define SYSCTL_SCGCHIB_OFFSET    ((uint32_t) 0x0714UL)
#define SYSCTL_SCGCUART_OFFSET    ((uint32_t) 0x0718UL)
#define SYSCTL_SCGCSSI_OFFSET    ((uint32_t) 0x071CUL)
#define SYSCTL_SCGCI2C_OFFSET    ((uint32_t) 0x0720UL)
#define SYSCTL_SCGCUSB_OFFSET    ((uint32_t) 0x0728UL)
#define SYSCTL_SCGCEPHY_OFFSET    ((uint32_t) 0x0730UL)
#define SYSCTL_SCGCCAN_OFFSET    ((uint32_t) 0x0734UL)
#define SYSCTL_SCGCADC_OFFSET    ((uint32_t) 0x0738UL)
#define SYSCTL_SCGCACMP_OFFSET    ((uint32_t) 0x073CUL)
#define SYSCTL_SCGCPWM_OFFSET    ((uint32_t) 0x0740UL)
#define SYSCTL_SCGCQEI_OFFSET    ((uint32_t) 0x0744UL)
#define SYSCTL_SCGCLPC_OFFSET    ((uint32_t) 0x0748UL)
#define SYSCTL_SCGCPECI_OFFSET    ((uint32_t) 0x0750UL)
#define SYSCTL_SCGCFAN_OFFSET    ((uint32_t) 0x0754UL)
#define SYSCTL_SCGCEEPROM_OFFSET    ((uint32_t) 0x0758UL)
#define SYSCTL_SCGCWTIMER_OFFSET    ((uint32_t) 0x075CUL)
#define SYSCTL_SCGCRTS_OFFSET    ((uint32_t) 0x0770UL)
#define SYSCTL_SCGCCCM_OFFSET    ((uint32_t) 0x0774UL)
#define SYSCTL_SCGCLCD_OFFSET    ((uint32_t) 0x0790UL)
#define SYSCTL_SCGCOWIRE_OFFSET    ((uint32_t) 0x0798UL)
#define SYSCTL_SCGCEMAC_OFFSET    ((uint32_t) 0x079CUL)
#define SYSCTL_SCGCPRB_OFFSET    ((uint32_t) 0x07A0UL)
#define SYSCTL_SCGCHIM_OFFSET    ((uint32_t) 0x07A4UL)

#define SYSCTL_DCGC_OFFSET    ((uint32_t) 0x0800UL)
#define SYSCTL_DCGCWD_OFFSET    ((uint32_t) 0x0800UL)
#define SYSCTL_DCGCTIMER_OFFSET    ((uint32_t) 0x0804UL)
#define SYSCTL_DCGCGPIO_OFFSET    ((uint32_t) 0x0808UL)
#define SYSCTL_DCGCDMA_OFFSET    ((uint32_t) 0x080CUL)
#define SYSCTL_DCGCEPI_OFFSET    ((uint32_t) 0x0810UL)
#define SYSCTL_DCGCHIB_OFFSET    ((uint32_t) 0x0814UL)
#define SYSCTL_DCGCUART_OFFSET    ((uint32_t) 0x0818UL)
#define SYSCTL_DCGCSSI_OFFSET    ((uint32_t) 0x081CUL)
#define SYSCTL_DCGCI2C_OFFSET    ((uint32_t) 0x0820UL)
#define SYSCTL_DCGCUSB_OFFSET    ((uint32_t) 0x0828UL)
#define SYSCTL_DCGCEPHY_OFFSET    ((uint32_t) 0x0830UL)
#define SYSCTL_DCGCCAN_OFFSET    ((uint32_t) 0x0834UL)
#define SYSCTL_DCGCADC_OFFSET    ((uint32_t) 0x0838UL)
#define SYSCTL_DCGCACMP_OFFSET    ((uint32_t) 0x083CUL)
#define SYSCTL_DCGCPWM_OFFSET    ((uint32_t) 0x0840UL)
#define SYSCTL_DCGCQEI_OFFSET    ((uint32_t) 0x0844UL)
#define SYSCTL_DCGCLPC_OFFSET    ((uint32_t) 0x0848UL)
#define SYSCTL_DCGCPECI_OFFSET    ((uint32_t) 0x0850UL)
#define SYSCTL_DCGCFAN_OFFSET    ((uint32_t) 0x0854UL)
#define SYSCTL_DCGCEEPROM_OFFSET    ((uint32_t) 0x0858UL)
#define SYSCTL_DCGCWTIMER_OFFSET    ((uint32_t) 0x085CUL)
#define SYSCTL_DCGCRTS_OFFSET    ((uint32_t) 0x0870UL)
#define SYSCTL_DCGCCCM_OFFSET    ((uint32_t) 0x0874UL)
#define SYSCTL_DCGCLCD_OFFSET    ((uint32_t) 0x0890UL)
#define SYSCTL_DCGCOWIRE_OFFSET    ((uint32_t) 0x0898UL)
#define SYSCTL_DCGCEMAC_OFFSET    ((uint32_t) 0x089CUL)
#define SYSCTL_DCGCPRB_OFFSET    ((uint32_t) 0x08A0UL)
#define SYSCTL_DCGCHIM_OFFSET    ((uint32_t) 0x08A4UL)

#define SYSCTL_PC_OFFSET    ((uint32_t) 0x0900UL)
#define SYSCTL_PCWD_OFFSET    ((uint32_t) 0x0900UL)
#define SYSCTL_PCTIMER_OFFSET    ((uint32_t) 0x0904UL)
#define SYSCTL_PCGPIO_OFFSET    ((uint32_t) 0x0908UL)
#define SYSCTL_PCDMA_OFFSET    ((uint32_t) 0x090CUL)
#define SYSCTL_PCEPI_OFFSET    ((uint32_t) 0x0910UL)
#define SYSCTL_PCHIB_OFFSET    ((uint32_t) 0x0914UL)
#define SYSCTL_PCUART_OFFSET    ((uint32_t) 0x0918UL)
#define SYSCTL_PCSSI_OFFSET    ((uint32_t) 0x091CUL)
#define SYSCTL_PCI2C_OFFSET    ((uint32_t) 0x0920UL)
#define SYSCTL_PCUSB_OFFSET    ((uint32_t) 0x0928UL)
#define SYSCTL_PCEPHY_OFFSET    ((uint32_t) 0x0930UL)
#define SYSCTL_PCCAN_OFFSET    ((uint32_t) 0x0934UL)
#define SYSCTL_PCADC_OFFSET    ((uint32_t) 0x0938UL)
#define SYSCTL_PCACMP_OFFSET    ((uint32_t) 0x093CUL)
#define SYSCTL_PCPWM_OFFSET    ((uint32_t) 0x0940UL)
#define SYSCTL_PCQEI_OFFSET    ((uint32_t) 0x0944UL)
#define SYSCTL_PCLPC_OFFSET    ((uint32_t) 0x0948UL)
#define SYSCTL_PCPECI_OFFSET    ((uint32_t) 0x0950UL)
#define SYSCTL_PCFAN_OFFSET    ((uint32_t) 0x0954UL)
#define SYSCTL_PCEEPROM_OFFSET    ((uint32_t) 0x0958UL)
#define SYSCTL_PCWTIMER_OFFSET    ((uint32_t) 0x095CUL)
#define SYSCTL_PCRTS_OFFSET    ((uint32_t) 0x0970UL)
#define SYSCTL_PCCCM_OFFSET    ((uint32_t) 0x0974UL)
#define SYSCTL_PCLCD_OFFSET    ((uint32_t) 0x0990UL)
#define SYSCTL_PCOWIRE_OFFSET    ((uint32_t) 0x0998UL)
#define SYSCTL_PCEMAC_OFFSET    ((uint32_t) 0x099CUL)
#define SYSCTL_PCPRB_OFFSET    ((uint32_t) 0x09A0UL)
#define SYSCTL_PCHIM_OFFSET    ((uint32_t) 0x09A4UL)

#define SYSCTL_PR_OFFSET    ((uint32_t) 0x0A00UL)
#define SYSCTL_PRWD_OFFSET    ((uint32_t) 0x0A00UL)
#define SYSCTL_PRTIMER_OFFSET    ((uint32_t) 0x0A04UL)
#define SYSCTL_PRGPIO_OFFSET    ((uint32_t) 0x0A08UL)
#define SYSCTL_PRDMA_OFFSET    ((uint32_t) 0x0A0CUL)
#define SYSCTL_PREPI_OFFSET    ((uint32_t) 0x0A10UL)
#define SYSCTL_PRHIB_OFFSET    ((uint32_t) 0x0A14UL)
#define SYSCTL_PRUART_OFFSET    ((uint32_t) 0x0A18UL)
#define SYSCTL_PRSSI_OFFSET    ((uint32_t) 0x0A1CUL)
#define SYSCTL_PRI2C_OFFSET    ((uint32_t) 0x0A20UL)
#define SYSCTL_PRUSB_OFFSET    ((uint32_t) 0x0A28UL)
#define SYSCTL_PREPHY_OFFSET    ((uint32_t) 0x0A30UL)
#define SYSCTL_PRCAN_OFFSET    ((uint32_t) 0x0A34UL)
#define SYSCTL_PRADC_OFFSET    ((uint32_t) 0x0A38UL)
#define SYSCTL_PRACMP_OFFSET    ((uint32_t) 0x0A3CUL)
#define SYSCTL_PRPWM_OFFSET    ((uint32_t) 0x0A40UL)
#define SYSCTL_PRQEI_OFFSET    ((uint32_t) 0x0A44UL)
#define SYSCTL_PRLPC_OFFSET    ((uint32_t) 0x0A48UL)
#define SYSCTL_PRPECI_OFFSET    ((uint32_t) 0x0A50UL)
#define SYSCTL_PRFAN_OFFSET    ((uint32_t) 0x0A54UL)
#define SYSCTL_PREEPROM_OFFSET    ((uint32_t) 0x0A58UL)
#define SYSCTL_PRWTIMER_OFFSET    ((uint32_t) 0x0A5CUL)
#define SYSCTL_PRRTS_OFFSET    ((uint32_t) 0x0A70UL)
#define SYSCTL_PRCCM_OFFSET    ((uint32_t) 0x0A74UL)
#define SYSCTL_PRLCD_OFFSET    ((uint32_t) 0x0A90UL)
#define SYSCTL_PROWIRE_OFFSET    ((uint32_t) 0x0A98UL)
#define SYSCTL_PREMAC_OFFSET    ((uint32_t) 0x0A9CUL)
#define SYSCTL_PRPRB_OFFSET    ((uint32_t) 0x0AA0UL)
#define SYSCTL_PRHIM_OFFSET    ((uint32_t) 0x0AA4UL)

#define SYSCTL_UNIQUEID_OFFSET    ((uint32_t) 0x0F20UL)
#define SYSCTL_UNIQUEID0_OFFSET    ((uint32_t) 0x0F20UL)
#define SYSCTL_UNIQUEID1_OFFSET    ((uint32_t) 0x0F24UL)
#define SYSCTL_UNIQUEID2_OFFSET    ((uint32_t) 0x0F28UL)
#define SYSCTL_UNIQUEID3_OFFSET    ((uint32_t) 0x0F2CUL)


#endif /* XDRIVER_MCU_DRIVER_HEADER_SYSCTL_SYSCTL_PERIPHERAL_SYSCTL_REGISTER_SYSCTL_REGISTERADDRESS_H_ */
